      *
      *	Copyright (c) 1992 USL
      * All rights reserved
      *
      *	THIS IS UNPUBLISHED PROPRIETARY
      *	SOURCE CODE OF USL
      *	The copyright notice above does not
      *	evidence any actual or intended
      *	publication of such source code.
      *
      * #ident	"@(#) cobol/cobatmi/TPQUEDEF.cbl	$Revision: 1.3 $" 
      * static	char	sccsid[] = "@(#) cobol/cobatmi/TPQUEDEF.cbl	$Revision: 1.3 $";
      *
      *  TPQUEDEF.cbl	
      *
	05 TPBLOCK-FLAG 	PIC S9(9) COMP-5.
		88 TPBLOCK	 	VALUE 0.
		88 TPNOBLOCK	 	VALUE 1.
	05 TPTRAN-FLAG 	PIC S9(9) COMP-5.
		88 TPTRAN  		VALUE 0.  
		88 TPNOTRAN		VALUE 1.
	05 TPTIME-FLAG 	PIC S9(9) COMP-5.
		88 TPTIME		VALUE 0.
		88 TPNOTIME		VALUE 1.
	05 TPSIGRSTRT-FLAG 	PIC S9(9) COMP-5.
		88 TPNOSIGRSTRT		VALUE 0.
		88 TPSIGRSTRT		VALUE 1.
	05 TPNOCHANGE-FLAG 	PIC S9(9) COMP-5.
		88 TPCHANGE 		VALUE 0.
		88 TPNOCHANGE		VALUE 1.
	05 TPQUE-ORDER-FLAG 	PIC S9(9) COMP-5.
		88 TPQDEFAULT		VALUE 0.
		88 TPQTOP		VALUE 1.
		88 TPQBEFOREMSGID	VALUE 2.
	05 TPQUE-TIME-FLAG 	PIC S9(9) COMP-5.
		88 TPQNOTIME		VALUE 0.
		88 TPQTIME-ABS		VALUE 1.
		88 TPQTIME-REL		VALUE 2.
	05 TPQUE-PRIORITY-FLAG 	PIC S9(9) COMP-5.
		88 TPQNOPRIORITY	VALUE 0.
		88 TPQPRIORITY		VALUE 1.
	05 TPQUE-CORRID-FLAG 	PIC S9(9) COMP-5.
		88 TPQNOCORRID		VALUE 0.
		88 TPQCORRID		VALUE 1.
	05 TPQUE-REPLYQ-FLAG 	PIC S9(9) COMP-5.
		88 TPQNOREPLYQ		VALUE 0.
		88 TPQREPLYQ		VALUE 1.
	05 TPQUE-FAILQ-FLAG 	PIC S9(9) COMP-5.
		88 TPQNOFAILUREQ	VALUE 0.
		88 TPQFAILUREQ		VALUE 1.
	05 TPQUE-MSGID-FLAG 	PIC S9(9) COMP-5.
		88 TPQNOMSGID		VALUE 0.
		88 TPQMSGID		VALUE 1.
	05 TPQUE-GETBY-FLAG 	PIC S9(9) COMP-5.
		88 TPQGETNEXT		VALUE 0.
		88 TPQGETBYMSGIDOLD	VALUE 1.
		88 TPQGETBYCORRIDOLD	VALUE 2.
		88 TPQGETBYMSGID	VALUE 3.
		88 TPQGETBYCORRID	VALUE 4.
	05 TPQUE-WAIT-FLAG 	PIC S9(9) COMP-5.
		88 TPQNOWAIT		VALUE 0.
		88 TPQWAIT		VALUE 1.
	05 TPQUE-DELIVERY-FLAG 	PIC S9(9) COMP-5.
		88 TPQNODELIVERYQOS	VALUE 0.
		88 TPQDELIVERYQOS	VALUE 1.
	05 TPQUEQOS-DELIVERY-FLAG 	PIC S9(9) COMP-5.
		88 TPQQOSDELIVERYDEFAULTPERSIST	VALUE 0.
		88 TPQQOSDELIVERYPERSISTENT	VALUE 1.
		88 TPQQOSDELIVERYNONPERSISTENT	VALUE 2.
	05 TPQUE-REPLY-FLAG 	PIC S9(9) COMP-5.
		88 TPQNOREPLYQOS		VALUE 0.
		88 TPQREPLYQOS			VALUE 1.
	05 TPQUEQOS-REPLY-FLAG 	PIC S9(9) COMP-5.
		88 TPQQOSREPLYDEFAULTPERSIST	VALUE 0.
		88 TPQQOSREPLYPERSISTENT	VALUE 1.
		88 TPQQOSREPLYNONPERSISTENT	VALUE 2.
	05 TPQUE-EXPTIME-FLAG 	PIC S9(9) COMP-5.
		88 TPQNOEXPTIME		VALUE 0.
		88 TPQEXPTIME-ABS	VALUE 1.
		88 TPQEXPTIME-REL	VALUE 2.
		88 TPQEXPTIME-NONE	VALUE 3.
	05 TPQUE-PEEK-FLAG 	PIC S9(9) COMP-5.
		88 TPQNOPEEK		VALUE 0.
		88 TPQPEEK		VALUE 1.
	05 DIAGNOSTIC		PIC S9(9) COMP-5.
		88 QMEINVAL		VALUE -1.
		88 QMEBADRMID		VALUE -2.
		88 QMENOTOPEN		VALUE -3.
		88 QMETRAN		VALUE -4.
		88 QMEBADMSGID		VALUE -5.
		88 QMESYSTEM		VALUE -6.
		88 QMEOS		VALUE -7.
		88 QMENOTA		VALUE -8.
		88 QMEPROTO		VALUE -9.
		88 QMEBADQUEUE		VALUE -10.
		88 QMENOMSG		VALUE -11.
		88 QMEINUSE		VALUE -12.
		88 QMENOSPACE		VALUE -13.
		88 QMERELEASE		VALUE -14.
		88 QMEINVHANDLE		VALUE -15.
		88 QMESHARE		VALUE -16.
	05 DEQ-TIME 		PIC 9(9) COMP-5.
	05 EXP-TIME 		PIC 9(9) COMP-5.
	05 PRIORITY		PIC S9(9) COMP-5.
	05 MSGID		PIC X(32).
	05 CORRID		PIC X(32).
	05 QNAME		PIC X(15).
	05 QSPACE-NAME		PIC X(15).
	05 REPLYQUEUE		PIC X(15).
	05 FAILUREQUEUE		PIC X(15).
	05 CLIENTID OCCURS 4 TIMES PIC S9(9) COMP-5.
	05 APPL-RETURN-CODE	PIC S9(9) COMP-5.
	05 APPKEY		PIC S9(9) COMP-5.
